import sys
# слід згадати, що sys.argv - звичайний список, який містить ім'я файлу та передані аргументи
# скопіюємо його без нульового елементу (імені файлу), використовуючи операцію "зрізу"
args = sys.argv[1:]

# залишається змінити порядок на зворотній, для цього є вбудована функція
args.reverse()

# і вивести
# але результат має бути записаний в 1 рядок через пробіли
# отже для правильного запису складемо всі значення разом. Спочатку перше (щоб не отримати зайвих пробілів)
result = args[0]

# далі в циклі додаємо наступні разом з пробілами
for item in args[1:]:
    result = result + ' ' + item

print(result)