def encode_morze(text):
    # задаємо словник для перетворення тексту
    morze = {
        "A": ".-",
        "B": "-...",
        "C": "-.-.",
        "D": "-..",
        "E": ".",
        "F": "..-.",
        "G": "--.",
        "H": "....",
        "I": "..",
        "J": ".---",
        "K": "-.-",
        "L": ".-..",
        "M": "--",
        "N": "-.",
        "O": "---",
        "P": ".--.",
        "Q": "--.-",
        "R": ".-.",
        "S": "...",
        "T": "-",
        "U": "..-",
        "V": "...-",
        "W": ".--",
        "X": "-..-",
        "Y": "-.--",
        "Z": "--..",
    }
    encoded = ''
    # перебираємо посимвольно. можна все опрацювати "реплейсами", але наврядчи буде працювати швидше
    for i in text:
        # формуємо фрагмент для додавання до відповіді
        to_add = ''
        # якщо пробіл в тексті, слід замістити його паузою
        # пауза коротша, ніж в умові, так як частину її додамо разом з останньою літерою попереднього слова
        if i == ' ':
            to_add = '____'
        # приводимо до верхнього регістра і шукаємо в словнику
        elif i.upper() in morze.keys():
            # взагалі можна було б переписати початковий словник одразу з ^_
            # але перекладемо літеру в тире-точки, а потім тире-точки - в сигнали та паузи
            # паузу між знаками (тире-точками) закладемо одразу при заміні
            # паузу між літерами додаємо в кінці. вона коротша, так як зайва пауза вже закладена в останній літері
            to_add = morze[i.upper()].replace('.', '^_').replace('-', '^^^_') + '__'
        encoded = encoded + to_add

    # але в кінці зайві _ таким чином залишаються - доведеться прибрати їх окремо
    if len(encoded):
        while encoded[-1] == '_':
            encoded = encoded[:-1]

    return encoded
print(encode_morze('Morze code'))